devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        *drvhdl = USART_data[dev];

        USART_data[dev]->USART          = USART_peripherals[dev];
        USART_data[dev]->data_write_sem = new_semaphore();
        USART_data[dev]->port_lock_mtx  = new_recursive_mutex();

        if (!USART_data[dev]->data_write_sem || !USART_data[dev]->port_lock_mtx) {
                goto error;
        } else {
                take_semaphore(USART_data[dev]->data_write_sem, 1);

                if (turn_on_USART(USART_data[dev]->USART) != STD_RET_OK) {
                        goto error;
                }

                enable_USART(USART_data[dev]->USART);

                if ((u32_t) USART_data[dev]->USART == USART1_BASE) {
                        set_baud_rate(USART_data[dev]->USART, UART_PCLK2_FREQ, UART_DEFAULT_BAUDRATE);
                } else {
                        set_baud_rate(USART_data[dev]->USART, UART_PCLK1_FREQ, UART_DEFAULT_BAUDRATE);
                }

                if (UART_DEFAULT_WAKE_METHOD) {
                        wakeup_USART_on_address_mark(USART_data[dev]->USART);
                } else {
                        wakeup_USART_on_idle_line(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_PARITY_ENABLE) {
                        enable_parity_check(USART_data[dev]->USART);
                } else {
                        disable_parity_check(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_PARITY_SELECTION) {
                        enable_odd_parity(USART_data[dev]->USART);
                } else {
                        enable_even_parity(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_TX_ENABLE) {
                        enable_transmitter(USART_data[dev]->USART);
                } else {
                        disable_transmitter(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_RX_ENABLE) {
                        enable_receiver(USART_data[dev]->USART);
                } else {
                        disable_receiver(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_RX_WAKEUP_MODE) {
                        receiver_wakeup_in_mute_mode(USART_data[dev]->USART);
                } else {
                        receiver_wakeup_in_active_mode(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_LIN_ENABLE) {
                        enable_LIN_mode(USART_data[dev]->USART);
                } else {
                        disable_LIN_mode(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_STOP_BITS) {
                        set_2_stop_bits(USART_data[dev]->USART);
                } else {
                        set_1_stop_bit(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_LIN_BREAK_LEN_DET) {
                        detect_11_bit_LIN_break(USART_data[dev]->USART);
                } else {
                        detect_10_bit_LIN_break(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_CTS_ENABLE) {
                        enable_CTS(USART_data[dev]->USART);
                } else {
                        disable_CTS(USART_data[dev]->USART);
                }

                if (UART_DEFAULT_RTS_ENABLE) {
                        enable_RTS(USART_data[dev]->USART);
                } else {
                        disable_RTS(USART_data[dev]->USART);
                }

                set_address_node(USART_data[dev]->USART, UART_DEFAULT_MULTICOM_ADDRESS);

                if (enable_USART_interrupts(USART_data[dev]->USART) != STD_RET_OK) {
                        goto error;
                }

                enable_RXNE_IRQ(USART_data[dev]->USART);

                return STD_RET_OK;
        }

error:
        if (USART_data[dev]->data_write_sem) {
                delete_semaphore(USART_data[dev]->data_write_sem);
        }

        if (USART_data[dev]->port_lock_mtx) {
                delete_recursive_mutex(USART_data[dev]->port_lock_mtx);
        }

        free(USART_data[dev]);
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release USART devices
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t UART_release(void *drvhdl)
{
        _stop_if(!drvhdl);

        struct USART_data *hdl = drvhdl;

        force_lock_recursive_mutex(hdl->port_lock_mtx);
        enter_critical_section();
        unlock_recursive_mutex(hdl->port_lock_mtx);
        delete_recursive_mutex(hdl->port_lock_mtx);
        delete_semaphore(hdl->data_write_sem);
        turn_off_USART(hdl->USART);
        free(hdl);
        exit_critical_section();

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Opens specified port
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t UART_open(void *drvhdl)
{
        _stop_if(!drvhdl);

        struct USART_data *hdl = drvhdl;

        if (lock_recursive_mutex(hdl->port_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                hdl->task = get_task_handle();
                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function close opened port
 *
 * @param[in] *drvhdl           driver's memory handler
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t UART_close(void *drvhdl)
{
        _stop_if(!drvhdl);

        struct USART_data *hdl = drvhdl;

        if (lock_recursive_mutex(hdl->port_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                hdl->task = NULL;
                unlock_recursive_mutex(hdl->port_lock_mtx);     /* give this mutex */
                unlock_recursive_mutex(hdl->port_lock_mtx);     /* give mutex from open */
                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Write data to UART (ISR or DMA)
 *
 * @param[in] *drvhdl           driver's memory handle
 * @param[in] *src              source
 * @param[in] size              size
 * @param[in] nitems            n items to read
 * @param[in] lseek             lseek
 *
 * @retval number of written nitems
 */
//==============================================================================
size_t UART_write(void *drvhdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        (void)lseek;

        _stop_if(!drvhdl);
        _stop_if(!src);
        _stop_if(!size);
        _stop_if(!nitems);

