devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        struct USART_data *hdl = drvhdl;

        size_t n = 0;
        if (lock_recursive_mutex(hdl->port_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                hdl->Tx_buffer.src_ptr   = src;
                hdl->Tx_buffer.data_size = size * nitems;

                enable_TXE_IRQ(hdl->USART);
                take_semaphore(hdl->data_write_sem, TXC_WAIT_TIME);

                n = nitems;

                unlock_recursive_mutex(hdl->port_lock_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from UART Rx buffer
 *
 * @param[in]  *drvhdl          driver's memory handle
 * @param[out] *dst             destination
 * @param[in]  size             size
 * @param[in]  nitems           n items to read
 * @param[in]  lseek            seek
 *
 * @retval number of read nitems
 */
//==============================================================================
size_t UART_read(void *drvhdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        (void)lseek;

        _stop_if(!drvhdl);
        _stop_if(!dst);
        _stop_if(!size);
        _stop_if(!nitems);

        struct USART_data *hdl = drvhdl;

        size_t n = 0;
        if (lock_recursive_mutex(hdl->port_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                u8_t  *dst_ptr   = (u8_t *)dst;
                size_t data_size = nitems * size;

                do {
                        enter_critical_section();

                        if (hdl->Rx_FIFO.buffer_level > 0) {
                                *dst_ptr = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                                if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                        hdl->Rx_FIFO.read_index = 0;

                                hdl->Rx_FIFO.buffer_level--;
                                data_size--;
                                n++;

                                exit_critical_section();
                        } else {
                                exit_critical_section();
                                suspend_this_task();
                        }
                } while (data_size);

                n /= size;

                unlock_recursive_mutex(hdl->port_lock_mtx);
        }

        return n;
}

//==============================================================================
/**
 * @brief Direct IO control
 *
 * @param[in]     *drvhdl       driver's memory handle
 * @param[in]     iorq          IO reqest
 * @param[in,out] args          additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t UART_ioctl(void *drvhdl, int iorq, va_list args)
{
        _stop_if(!drvhdl);

        struct USART_data *hdl = drvhdl;
        stdret_t status = STD_RET_OK;
        u8_t *out_ptr;

        if (lock_recursive_mutex(hdl->port_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                switch (iorq) {
                case UART_IORQ_ENABLE_WAKEUP_IDLE:
                        wakeup_USART_on_idle_line(hdl->USART);
                        break;

                case UART_IORQ_ENABLE_WAKEUP_ADDRESS_MARK:
                        wakeup_USART_on_address_mark(hdl->USART);
                        break;

                case UART_IORQ_ENABLE_PARITY_CHECK:
                        enable_parity_check(hdl->USART);
                        break;

                case UART_IORQ_DISABLE_PARITY_CHECK:
                        disable_parity_check(hdl->USART);
                        break;

                case UART_IORQ_SET_ODD_PARITY:
                        enable_odd_parity(hdl->USART);
                        break;

                case UART_IORQ_SET_EVEN_PARITY:
                        enable_even_parity(hdl->USART);
                        break;

                case UART_IORQ_ENABLE_RECEIVER_WAKEUP_MUTE:
                        receiver_wakeup_in_mute_mode(hdl->USART);
                        break;

                case UART_IORQ_DISABLE_RECEIVER_WAKEUP_MUTE:
                        receiver_wakeup_in_active_mode(hdl->USART);
                        break;

                case UART_IORQ_ENABLE_LIN_MODE:
                        enable_LIN_mode(hdl->USART);
                        break;

                case UART_IORQ_DISABLE_LIN_MODE:
                        disable_LIN_mode(hdl->USART);
                        break;

                case UART_IORQ_SET_1_STOP_BIT:
                        set_1_stop_bit(hdl->USART);
                        break;

                case UART_IORQ_SET_2_STOP_BITS:
                        set_2_stop_bits(hdl->USART);
                        break;

                case UART_IORQ_SET_LIN_BRK_DETECTOR_11_BITS:
                        detect_11_bit_LIN_break(hdl->USART);
                        break;

                case UART_IORQ_SET_LIN_BRK_DETECTOR_10_BITS:
                        detect_10_bit_LIN_break(hdl->USART);
                        break;

                case UART_IORQ_SET_ADDRESS_NODE:
                        set_address_node(hdl->USART, va_arg(args, int));
                        break;

                case UART_IORQ_ENABLE_CTS:
                        enable_CTS(hdl->USART);
                        break;

                case UART_IORQ_DISABLE_CTS:
                        disable_CTS(hdl->USART);
                        break;

                case UART_IORQ_ENABLE_RTS:
                        enable_RTS(hdl->USART);
                        break;

                case UART_IORQ_DISABLE_RTS:
                        disable_RTS(hdl->USART);
                        break;

                case UART_IORQ_GET_BYTE:
                        enter_critical_section();

                        if (!(out_ptr = va_arg(args, u8_t*))) {
                                exit_critical_section();
                                status = STD_RET_ERROR;
                                break;
                        }

                        if (hdl->Rx_FIFO.buffer_level > 0) {
                                *out_ptr = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                                if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                        hdl->Rx_FIFO.read_index = 0;

                                hdl->Rx_FIFO.buffer_level--;
                        } else {
                                status = STD_RET_ERROR;
                        }

                        exit_critical_section();
                        break;

                case UART_IORQ_GET_BYTE_BLOCKING:
                        while (TRUE) {
                                enter_critical_section();

