devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
                                if (!(out_ptr = va_arg(args, u8_t*))) {
                                        exit_critical_section();
                                        status = STD_RET_ERROR;
                                        break;
                                }

                                if (hdl->Rx_FIFO.buffer_level > 0) {
                                        *out_ptr = hdl->Rx_FIFO.buffer[hdl->Rx_FIFO.read_index++];

                                        if (hdl->Rx_FIFO.read_index >= UART_RX_BUFFER_SIZE)
                                                hdl->Rx_FIFO.read_index = 0;

                                        hdl->Rx_FIFO.buffer_level--;

                                        exit_critical_section();
                                        break;
                                } else {
                                        exit_critical_section();
                                        suspend_this_task();
                                }
                        }
                        break;

                case UART_IORQ_SEND_BYTE:
                        while (!(hdl->USART->SR & USART_SR_TXE)) {
                                sleep_ms(1);
                        }

                        hdl->USART->DR = va_arg(args, int);
                        break;

                case UART_IORQ_SET_BAUDRATE:
                        if ((u32_t)hdl->USART == USART1_BASE) {
                                set_baud_rate(hdl->USART, UART_PCLK2_FREQ, va_arg(args, int));
                        } else {
                                set_baud_rate(hdl->USART, UART_PCLK1_FREQ, va_arg(args, int));
                        }
                        break;

                default:
                        status = STD_RET_ERROR;
                        break;
                }

                unlock_recursive_mutex(hdl->port_lock_mtx);
        } else {
                return STD_RET_ERROR;
        }

        return status;
}

//==============================================================================
/**
 * @brief Function flush device
 *
 * @param[in] *drvhdl           driver's memory handle
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t UART_flush(void *drvhdl)
{
        _stop_if(drvhdl);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function returns device informations
 *
 * @param[in]  *drvhld          driver's memory handle
 * @param[out] *info            device/file info
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t UART_info(void *drvhdl, struct vfs_dev_info *info)
{
        _stop_if(drvhdl);
        _stop_if(!info);

        info->st_size = 0;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Interrupt handling
 *
 * @param usart   usart address
 * @param dev     device number
 */
//==============================================================================
static void IRQ_handler(struct USART_data *USART_data)
{
        /* transmitter interrupt handler */
        if (USART_data->USART->SR & USART_SR_TXE) {
                if (USART_data->Tx_buffer.data_size && USART_data->Tx_buffer.src_ptr) {
                        USART_data->USART->DR = *(USART_data->Tx_buffer.src_ptr++);

                        if (--USART_data->Tx_buffer.data_size == 0) {
                                USART_data->Tx_buffer.src_ptr = NULL;

                                i32_t woke;
                                disable_TXE_IRQ(USART_data->USART);
                                give_semaphore_from_ISR(USART_data->data_write_sem, &woke);
                        }
                } else {
                        disable_TXE_IRQ(USART_data->USART);
                }
        }

        /* receiver interrupt handler */
        if (USART_data->USART->SR & USART_SR_RXNE) {
                u8_t DR = USART_data->USART->DR;

                if (USART_data->Rx_FIFO.buffer) {
                        if (USART_data->Rx_FIFO.buffer_level < UART_RX_BUFFER_SIZE) {
                                USART_data->Rx_FIFO.buffer[USART_data->Rx_FIFO.write_index++] = DR;

                        if (USART_data->Rx_FIFO.write_index >= UART_RX_BUFFER_SIZE)
                                USART_data->Rx_FIFO.write_index = 0;

                        USART_data->Rx_FIFO.buffer_level++;
                  }

                  if (USART_data->task) {
                        if (resume_task_from_ISR(USART_data->task) == pdTRUE) {
                                yield_task();
                        }
                  }
            }
        }
}

//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_on_USART(USART_t *USART)
{
        switch ((u32_t)USART) {
#if defined(RCC_APB2ENR_USART1EN) && (UART_1_ENABLE > 0)
        case USART1_BASE:
                RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
                break;
#endif
#if defined(RCC_APB1ENR_USART2EN) && (UART_2_ENABLE > 0)
        case USART2_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
                break;
#endif
#if defined(RCC_APB1ENR_USART3EN) && (UART_3_ENABLE > 0)
        case USART3_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_USART3EN;
                break;
#endif
#if defined(RCC_APB1ENR_UART4EN)  && (UART_4_ENABLE > 0)
        case UART4_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_UART4EN;
                break;
#endif
#if defined(RCC_APB1ENR_UART5EN)  && (UART_5_ENABLE > 0)
        case UART5_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_UART5EN;
                break;
#endif
        default:
                return STD_RET_ERROR;
        }

