devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function disable USART clock
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_off_USART(USART_t *USART)
{
        switch ((u32_t)USART) {
#if defined(RCC_APB2ENR_USART1EN) && (UART_1_ENABLE > 0)
        case USART1_BASE:
                NVIC_DisableIRQ(USART1_IRQn);
                RCC->APB2RSTR |=  RCC_APB2RSTR_USART1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_USART1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_USART1EN;
                break;
#endif
#if defined(RCC_APB1ENR_USART2EN) && (UART_2_ENABLE > 0)
        case USART2_BASE:
                NVIC_DisableIRQ(USART2_IRQn);
                RCC->APB1RSTR |=  RCC_APB1RSTR_USART2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_USART2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_USART2EN;
                break;
#endif
#if defined(RCC_APB1ENR_USART3EN) && (UART_3_ENABLE > 0)
        case USART3_BASE:
                NVIC_DisableIRQ(USART3_IRQn);
                RCC->APB1RSTR |=  RCC_APB1RSTR_USART3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_USART3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_USART3EN;
                break;
#endif
#if defined(RCC_APB1ENR_UART4EN)  && (UART_4_ENABLE > 0)
        case UART4_BASE:
                NVIC_DisableIRQ(UART4_IRQn);
                RCC->APB1RSTR |=  RCC_APB1RSTR_UART4RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_UART4RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_UART4EN;
                break;
#endif
#if defined(RCC_APB1ENR_UART5EN)  && (UART_5_ENABLE > 0)
        case UART5_BASE:
                NVIC_DisableIRQ(UART5_IRQn);
                RCC->APB1RSTR |=  RCC_APB1RSTR_UART5RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_UART5RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_UART5EN;
                break;
#endif
        default:
                return STD_RET_ERROR;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function turn on the USART interrupts
 *
 * @param[in] *USART            peripheral address
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t enable_USART_interrupts(USART_t *USART)
{
        switch ((u32_t)USART) {
#if defined(RCC_APB2ENR_USART1EN) && (UART_1_ENABLE > 0)
        case USART1_BASE:
                NVIC_EnableIRQ(USART1_IRQn);
                NVIC_SetPriority(USART1_IRQn, IRQ_PRIORITY);
                break;
#endif
#if defined(RCC_APB1ENR_USART2EN) && (UART_2_ENABLE > 0)
        case USART2_BASE:
                NVIC_EnableIRQ(USART2_IRQn);
                NVIC_SetPriority(USART2_IRQn, IRQ_PRIORITY);
                break;
#endif
#if defined(RCC_APB1ENR_USART3EN) && (UART_3_ENABLE > 0)
        case USART3_BASE:
                NVIC_EnableIRQ(USART3_IRQn);
                NVIC_SetPriority(USART3_IRQn, IRQ_PRIORITY);
                break;
#endif
#if defined(RCC_APB1ENR_UART4EN)  && (UART_4_ENABLE > 0)
        case UART4_BASE:
                NVIC_EnableIRQ(UART4_IRQn);
                NVIC_SetPriority(UART4_IRQn, IRQ_PRIORITY);
                break;
#endif
#if defined(RCC_APB1ENR_UART5EN)  && (UART_5_ENABLE > 0)
        case UART5_BASE:
                NVIC_EnableIRQ(UART5_IRQn);
                NVIC_SetPriority(UART5_IRQn, IRQ_PRIORITY);
                break;
#endif
        default:
                return STD_RET_ERROR;
        }

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief USART1 Interrupt
 */
//==============================================================================
#if defined(RCC_APB2ENR_USART1EN) && (UART_1_ENABLE > 0)
void USART1_IRQHandler(void)
{
        IRQ_handler(USART_data[UART_DEV_1]);
}
#endif

//==============================================================================
/**
 * @brief USART2 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART2EN) && (UART_2_ENABLE > 0)
void USART2_IRQHandler(void)
{
        IRQ_handler(USART_data[UART_DEV_2]);
}
#endif

//==============================================================================
/**
 * @brief USART3 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART3EN) && (UART_3_ENABLE > 0)
void USART3_IRQHandler(void)
{
        IRQ_handler(USART_data[UART_DEV_3]);
}
#endif

//==============================================================================
/**
 * @brief UART4 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART4EN) && (UART_4_ENABLE > 0)
void UART4_IRQHandler(void)
{
        IRQ_handler(USART_data[UART_DEV_4]);
}
#endif

//==============================================================================
/**
 * @brief UART5 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART5EN) && (UART_5_ENABLE > 0)
void UART5_IRQHandler(void)
{
        IRQ_handler(USART_data[UART_DEV_5]);
}
#endif

#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
